Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཤིན་ཏུ་དཀར་བ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་ཇི་ལྟར་འཐོབ་པ་དང་།
en: How is this absorption of the pristine and immaculate seal of the bodhisattva great beings attained?

source: ཅིའི་སླད་དུ་ཤིན་ཏུ་དཀར་བ་དྲི་མ་མེད་པ་ཞེས་བགྱི་བ་
en: Why is it said to be pristine and immaculate?

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་དེ་ལེགས་པར་བཤད་དུ་གསོལ།
en: Blessed Thus-Gone One, please elucidate this!

source: ཏིང་ངེ་འཛིན་དེ་ལ་འཇུག་པའི་སྒོར་འཇུག་པ་གང་ཐོས་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཏིང་ངེ་འཛིན་འདི་འཐོབ་ཅིང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ།
en: Once bodhisattva great beings have been introduced to the means by which one enters this absorption, they will attain it and fully awaken to unsurpassed and perfect buddhahood in a swift manner.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་ལེགས་པར་བཤད་དུ་གསོལ།
en: Blessed Thus-Gone One, please elucidate this!”

source: སྐྱེས་བུ་དམ་པ་ལེགས་སོ་ལེགས་སོ། །
en: “Excellent, excellent, sublime being.

source: ཀྱེ་མ་དྲི་བ་འདི་བཟང་ཞིང་དཔྱོད་པ་དེ་ཚུལ་བཞིན་ཡིན་ཏེ།
en: Yes, this question is excellent and your concern is appropriate.

source: དེའི་ཕྱིར་རིགས་ཀྱི་བུ་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་།
en: Thus, noble son, listen well and bear what I say in mind.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་ཤིན་ཏུ་དཀར་བ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་འདི་ཇི་ལྟར་འཐོབ་པ་དང་། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་ངས་བཤད་པར་བྱའོ། །
en: I will elucidate how bodhisattva great beings can attain this absorption of the pristine and immaculate seal and swiftly and fully awaken to unsurpassed and perfect buddhahood.”

source: བཅོམ་ལྡན་འདས་ལེགས་སོ་ཞེས་གསོལ་ཏེ།
en: “Wonderful, Blessed One!”

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྒྱ་མཚོ་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The bodhisattva great being Sāgaramati then listened as the Blessed One had instructed, while the Blessed One spoke.

source: !བློ་གྲོས་རྒྱ་མཚོ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་དགེ་བའི་རྩ་བས་བསྟན་པ་ཡིན་ཏེ།
en: “Sāgaramati, bodhisattva great beings attain stability due to their roots of virtue.

source: !དགེ་བའི་བསམ་པ་དང་ལྡན་པ། ངེས་པའི་ཕུང་པོ་ལ་རབ་ཏུ་གནས་པ། ཚོགས་བསགས་པ། དབང་པོ་རྣོ་བ། དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་ཟིན་པ། སངས་རྒྱས་ཀྱིས་བྱིན་གྱིས་བརླབས་པ། རྒྱུའི་སྟོབས་ཅན་ཡིན་ཏེ
en: They possess virtuous thoughts, keep to gentle aggregates, gather accumulations, have sharp faculties, are accepted by spiritual friends, are blessed by buddhas, and are skilled in debate.

source: དེ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མཉེས་པར་བྱེད། བསྟི་སྟང་དུ་བྱེད། བླ་མར་བྱེད། རིམ་གྲོར་བྱེད། མཆོད་པར་བྱེད་དོ། །
en: They please, serve, honor, respect, and venerate blessed buddhas.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་གཟུགས་ཕུན་སུམ་ཚོགས་པ་མཐོང་ཞིང་གསུང་སྙན་པ་ཐོས་ཏེ།
en: They behold the perfect appearance of the blessed buddhas and hear their speech.

source: འཁོར་ཕུན་སུམ་ཚོགས་པ་ཡང་མཐོང་ཞིང་ཆགས་པ་མེད་པའི་མཁྱེན་པ་ཡང་ཐོས་ལ།
en: They also behold perfect assemblies and listen to their unobstructed wisdom.

source: རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་ལམ། ཀུན་བརྗོད་པའི་ཆོ་འཕྲུལ་ལམ། རྗེས་སུ་བསྟན་པའི་ཆོ་འཕྲུལ་གྱིས་སེམས་ཅན་འདུལ་བ་མཛད་པ་ཡང་མཐོང་ནས་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོ་སྐྱེས་ཏེ
en: They witness how beings are guided through miraculous displays, miraculous discourses, and miraculous teachings, and they develop great compassion for beings.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས། བརྩོན་འགྲུས་བརྩམས་པ་ཡིན་ཏེ།
en: Having developed the mind directed toward unsurpassed and perfect awakening, they are diligent.

source: དགེ་བའི་ཆོས་ཡོངས་སུ་ཚོལ་བ་ལ་བརྩོན་ཞིང་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་བརྗེད་པ་མེད་པས་སེམས་ཡོངས་སུ་དག་པར་རྣལ་འབྱོར་དུ་བྱེད་དོ། །
en: They engage in the pursuit of virtuous qualities and practice to purify the mind by not forgetting the wisdom of omniscience.

source: དེ་སེམས་ཡོངས་སུ་དག་པས་ཏིང་ངེ་འཛིན་ཡོངས་སུ་དག་པ་རབ་ཏུ་འཐོབ་བོ། །
en: As their minds are purified, they attain pure absorption.

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་ལྟ་སྟེ།
en: “Sāgaramati, I will draw an analogy.

source: དཔེར་ན་རིགས་འཕགས་པའི་ནོར་བུ་རིན་པོ་ཆེ་ནོར་བུ་མཁན་མཁས་པའི་ལག་ཏུ་སོན་པ། ཇི་ཙམ་ན་ཡོངས་སུ་དག་པ་དང་། ཤིན་ཏུ་དཀར་བ་དང་། མཐིང་བུ་དང་བྲལ་བ་དང་། སྐྱོན་མེད་པར་གྱུར་པ་དེ་སྲིད་དུ་ཡོངས་སུ་སྦྱངས་ན
en: When a precious gem of the finest class comes into the possession of a skilled jeweler, he will refine it so that it becomes perfectly pure, pristine, polished, and flawless.

source: སྐྱེས་བུ་མཁས་པ་ནོར་བུ་རིན་པོ་ཆེ་ལ་མཁས་པ་རྣམས་འདུ་བར་འགྱུར་རོ། །
en: At that point, learned people with knowledge of precious gems will assemble.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་རིགས་འཕགས་པས་ཐམས་ཅད་མཁྱེན་པར་སེམས་བསྐྱེད་པ་རིན་པོ་ཆེ་བསྐྱེད་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ། ཇི་ཙམ་ན་མཐིང་བུ་དང་བྲལ་ཞིང་རློམ་སེམས་ཀྱི་མཐིང་བུ་དང་བྲལ་བར་འགྱུར་བ་དེ་སྲིད་དུ།
en: Sāgaramati, likewise, once bodhisattvas develop the precious gem of the finest class, which is the mind directed toward omniscience, they fully awaken to unsurpassed and perfect buddhahood.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྦྱང་བ་བྱ་བ་དང་།
en: Bodhisattva great beings will then purify their roots of virtue and their learning to the degree that they have eliminated stains, including the stain of arrogance.

source: ཐོས་པ་ལ་མཁས་པ་ཡོངས་སུ་སྦྱང་བ་བྱ་བས་ཐམས་ཅད་མཁྱེན་པའི་སེམས་བསྐྱེད་པའི་རིན་པོ་ཆེ་དེ་ཡོངས་སུ་སྦྱངས་ན་ཕྱོགས་བཅུའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འདུ་ཞིང་ཤིན་ཏུ་དཀར་བ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་འདི་ཡང་འཐོབ་བོ། །
en: At that point, once they have refined the precious gem of the mind directed toward omniscience, they attract the blessed buddhas of the ten directions and attain this pristine and immaculate absorption seal.

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: “Sāgaramati, I will draw another analogy:

source: རིགས་འཕགས་པའི་ནོར་བུ་རིན་པོ་ཆེ་དེ་ནི་རིན་པོ་ཆེའི་རིགས་དགུ་ལས་ཤིན་ཏུ་འདས་པར་འབྱུང་སྟེ།
en: There is a precious gem of the finest class that surpasses the nine types of precious substances—

source: གསེར་གྱི་རིགས་དང་། དངུལ་གྱི་རིགས་དང་། ཤེལ་གྱི་རིགས་དང་། བཻ་དཱུརྱའི་རིགས་དང་། རྡོའི་སྙིང་པོའི་རིགས་དང་། སྤུག་གི་རིགས་དང་། མུ་ཏིག་དམར་པོའི་རིགས་དང་། ཀེ་ས་རའི་རིགས་དང་། དཔལ་གྱི་སྙིང་པོའི་རིགས་ཏེ
en: gold, silver, crystal, beryl, emerald, coral, red pearl, kesara, and śrīgarbha.

source: ནོར་བུ་རིན་པོ་ཆེའི་རིགས་དགུ་པོ་འདི་དག་ལས་ཤིན་ཏུ་འདས་ནས། དྲི་མ་མེད་ཅིང་རྣམ་པར་དག་པའི་འོད་ཅེས་བྱ་བའི་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོའི་རིགས་དེ་ལས་དེ་རིན་ཐང་མེད་པའི་ནོར་བུ་རིན་པོ་ཆེར་འགྱུར་ཏེ།
en: Surpassing these nine types of precious substances, this great jewel, which is known as “stainless and immaculate light,” is more precious than any other gem.

source: དེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་ཡོངས་སུ་སྤྱད་པར་འགྱུར་གྱི། དེ་མ་ཡིན་པའི་སེམས་ཅན་ཕལ་པ་གཞན་རྣམས་ཀྱི་ནི་མ་ཡིན་ཏེ།
en: It is only found in the possession of a universal monarch, and not with any other ordinary being.

source: ནོར་བུ་རིན་པོ་ཆེ་དེའི་འོད་གང་ཡིན་པ་དེས་ནི་དེ་མ་ཡིན་པའི་ནོར་བུ་རིན་པོ་ཆེ་གཞན་རྣམས་ཀྱི་འོད་མོག་མོག་པོར་བྱེད་དོ། །
en: The luster of this precious gem eclipses the luster of any other precious gem.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པར་སེམས་བསྐྱེད་པའི་རིན་པོ་ཆེ་དེ་ཡང་རིན་པོ་ཆེའི་རིགས་དགུ་ལས་ཤིན་ཏུ་འདས་པར་བྱུང་སྟེ། དགུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: Sāgaramati, likewise the jewel of developing the mind directed toward omniscience surpasses nine other types of jewels—

source: སོ་སོའི་སྐྱེ་བོ་དགེ་བའི་རིན་པོ་ཆེའི་རིགས་དང་།
en: the jewel of ordinary beings’ virtue,

source: དད་པའི་རྗེས་སུ་འབྲང་བའི་རིན་པོ་ཆེའི་རིགས་དང་།
en: the jewel of faithful followers,

source: ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བའི་རིན་པོ་ཆེའི་རིགས་དང་།
en: the jewel of Dharma followers,

source: མཚན་མ་མེད་པ་ལ་གནས་པ་རིན་པོ་ཆེའི་རིགས་དང་།
en: the jewel of those who maintain signlessness,

source: རྒྱུན་ཏུ་ཞུགས་པ་རིན་པོ་ཆེའི་རིགས་དང་། །
en: the jewel of stream-enterers,

source: ལན་ཅིག་ཕྱིར་འོང་བ་རིན་པོ་ཆེའི་རིགས་དང་།
en: the jewel of once-returners,

source: ཕྱིར་མི་འོང་བ་རིན་པོ་ཆེའི་རིགས་དང་།
en: the jewel of non-returners,

source: དགྲ་བཅོམ་པ་རིན་པོ་ཆེའི་རིགས་དང་།
en: the jewel of worthy ones,

source: རང་སངས་རྒྱས་རིན་པོ་ཆེའི་རིགས་དང་།
en: and the jewel of solitary buddhas.

source: རིན་པོ་ཆེའི་རིགས་དགུ་པོ་འདི་དག་ལས་ཤིན་ཏུ་འདས་ནས་
en: It surpasses these nine types of jewels.

source: བཅུ་པ་སངས་རྒྱས་ཀྱིས་བྱིན་གྱིས་བརླབས་པའི་ལྷག་པའི་བསམ་པ་སྙིང་རྗེ་ཆེན་པོའི་རིན་པོ་ཆེའི་རིགས་ལས་ཐམས་ཅད་མཁྱེན་པར་སེམས་བསྐྱེད་པ་དེ་རིན་པོ་ཆེ་འབྱུང་སྟེ
en: This jewel of developing the mind directed toward omniscience is born from a tenth class of jewel, the outlook of great compassion blessed by the buddhas.

source: དེ་ཡོངས་སུ་སྦྱངས་ན་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཟིལ་གྱིས་ནོན་ཅིང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་རྒྱུད་རྣམས་ལ་ཡང་སྣང་བར་བྱེད་དོ། །
en: Once purified, this jewel will outshine all hearers and solitary buddhas, and illuminate the minds of all beings.

source: ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་གང་གི་ཚེ། སྦྱང་བཟོད་ཅིང་གནོད་པ་བཟོད་ལ། ཕུགས་ནས་ཀྱང་ཉེས་པར་མ་གྱུར་ན།
en: That great precious gem can withstand both refinement and harm without its core being impaired.

source: ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་ནི་འདི་ལྟར་སེམས་ཅན་བསོད་ནམས་བྱས་པ། དགེ་བའི་རྩ་བ་བསྐྱེད་པ་རྣམས་ལ་ཕན་པ་བྱེད་པར་འགྱུར་རོ། །
en: As such it can benefit beings who have created merit and developed roots of virtue.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་བཞིན་དུ་ཐམས་ཅད་མཁྱེན་པར་སེམས་བསྐྱེད་པ་རིན་པོ་ཆེ་དེ་ཡང་གང་གི་ཚེ་སྦྱང་བཟོད་ཅིང་གནོད་པ་བཟོད་ལ། ཕུགས་ནས་
en: Sāgaramati, likewise, the jewel of developing the mind directed toward omniscience can withstand both refinement and harm without its core being impaired.

source: ཀྱང་ཉེས་པར་མ་གྱུར་ན་ཐམས་ཅད་མཁྱེན་པར་སེམས་བསྐྱེད་པ་རིན་པོ་ཆེ་སྐྱོན་ཐམས་ཅད་དང་བྲལ་བ་དེ་འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་བྱེད་པར་འགྱུར་རོ། །
en: As such, this faultless jewel of developing the mind directed toward omniscience can benefit all beings.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལ་ཐམས་ཅད་མཁྱེན་པར་སེམས་བསྐྱེད་པ་རིན་པོ་ཆེ་དེ་སྦྱང་བ་གང་ཞེ་ན།
en: “How is the jewel that develops the mind directed toward omniscience refined, Sāgaramati?

source: འདི་ལྟ་སྟེ། སྡོམ་པ་གསུམ་གྱིས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡོངས་སུ་དག་པ་དང་།
en: Through the three vows, one purifies the path of the ten virtuous actions.

source: བྱམས་པའི་རྗེས་སུ་འཇུག་པས་སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་ཤིང་དང་བ་དང་།
en: Through training in love, one develops love and appreciation for all beings.

source: སྙིང་རྗེའི་རྗེས་སུ་འཇུག་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བྱ་བ་ཅི་ཡོད་སྙམ་པ་ལ་བརྩོན་པ་དང་།
en: Through training in compassion, one becomes diligent in considering beings’ affairs.

source: དགའ་བའི་རྗེས་སུ་འཇུག་པས་སེམས་ཅན་ཐམས་ཅད་ཆོས་ལ་སྦྱོར་བ་དང་།
en: Through training in joy, one brings all beings to the Dharma.

source: བཏང་སྙོམས་ཀྱི་རྗེས་སུ་འཇུག་པས་སེམས་ཅན་ཐམས་ཅད་ལ་མི་འཚེ་ཞིང་རྟག་ཏུ་སེམས་དྲང་བ་དང་།
en: Through training in equanimity, one will keep an honest mind and never harm beings.

source: གཡོ་དང་སྒྱུ་མེད་པས་ཕན་པའི་དངོས་པོའི་བསམ་པར་གྱུར་པ་དང་། དགེ་བའི་རྩ་བ་ཐམས་ཅད་བརྩམ་པ་ལ་ལྷག་པའི་བསམ་པ་སྦྱོར་བ་དང་།
en: “By eliminating hypocrisy and pretense, one will turn to what is of benefit and one will be motivated to endeavor in all roots of virtue.

source: ཅང་ཤེས་ཀྱི་སེམས་ཀྱིས་དྲན་པ་དང་ཤེས་བཞིན་དང་ལྡན་པ་དང་།
en: By being intelligent, one will come to possess mindfulness and awareness.

source: སེམས་ཤིན་ཏུ་དུལ་བས་སེམས་ལས་སུ་རུང་བ་དང་།
en: By taming the mind, the mind becomes pliant.

source: དགང་སླ་བས་སྦྱངས་པའི་ཡོན་ཏན་ཡོ་བྱད་བསྙུངས་པའི་ཆོ་ག་དང་ལྡན་པ་དང་།
en: By being easily content, one comes to adopt ascetic qualities and the ways of living with fewer things.

source: གསོ་སླ་བས་འཕགས་པའི་རིགས་ཆོག་ཤེས་པ་དང་། བླ་མ་དང་སྦྱིན་གནས་རྣམས་ལ་འདུད་ཅིང་རབ་ཏུ་འདུད་པ་དང་།
en: By being easily sustained, one acquires the contentment of the noble family and bows before teachers and those who are worthy of offerings.

source: ང་རྒྱལ་མེད་པས་ཁེངས་པ་དང་རྩོད་པ་རྣམ་པར་སྤོང་བ་དང་།
en: “By eliminating pride, one discards all arrogance and dispute.

source: སེམས་ངེས་པར་སེམས་པས་ང་རྒྱལ་ལས་ཀྱང་ང་རྒྱལ་རྣམ་པར་སྤོང་བ་དང་།
en: By coming to certainty, one discards all forms of pride.

source: རྙོག་པ་མེད་པས་སེམས་གསལ་བ་དང་།
en: By eliminating all turbidity, the mind is clarified.

source: བདག་ལ་མི་སྟོད་པས་བདག་ཤེས་པ་ལ་འཇུག་པ་དང་།
en: Through not praising oneself, one comes to understand oneself.

source: གཞན་ལ་མི་སྨོད་པས་སེམས་ཅན་རྗེས་སུ་སྲུང་བ་དང་།
en: Through never slandering others, one protects beings.

source: སྨན་གྱི་སེམས་ཀྱིས་ཆོས་ལ་གུས་པ་དང་།
en: “By seeing the Dharma as medicine, one is respectful of it.

source: དེའི་དོན་སོ་སོར་མྱོང་བས་ཆོས་དོན་དུ་གཉེར་བ་དང་།
en: Through experiencing the meaning of the Dharma, one will pursue it.

source: དེ་ལ་གཞོལ་འབབ་བབ་པས་ཆོས་འདོད་པ་དང་།
en: By becoming immersed in it, one yearns for the Dharma.

source: ཉོན་མོངས་པ་མེད་པ་ལ་གནས་པས་ཆོས་ལ་དགའ་བ་དང་།
en: By living without afflictive emotions, one delights in the Dharma.

source: ཆོས་མ་ཡིན་པ་རྣམ་པར་སྤོང་བས་ཆོས་ཡོངས་སུ་ཚོལ་བ་དང་།
en: By discarding everything that is not Dharma, one seeks the Dharma.

source: རྟག་ཏུ་ངོ་ཚ་ཤེས་པས་དཀོན་མཆོག་གསུམ་ལ་དད་པ་རྒྱུན་མི་འཆད་པ་དང་།
en: By being constantly conscientious, one’s faith in the Three Jewels is never broken.

source: ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་ཡིད་ཆེས་པས་དགེ་བ་ཐམས་ཅད་ཡིད་ལ་བྱེད་པའི་བྱ་བ་ལ་འཇུག་པ་དང་།
en: By trusting in the ripening of karma, one will contemplate all virtues to be performed.

source: དྲང་བས་སྤྱོད་ལམ་སྦས་པ་དང་།
en: By honesty, one can keep one’s conduct hidden.

source: ཁེངས་པ་མེད་པས་མཉེན་པ་དང་།
en: By eliminating arrogance, one becomes mild.

source: ཞི་གནས་ཡོངས་སུ་ཚོལ་བས་རྒོད་པ་དང་བྲལ་བ་དང་།
en: By seeking tranquility, one is freed from agitation.

source: བློ་བརྟན་པས་སྙོམ་ལས་མེད་པ་དང་།
en: Through being resolute, one eliminates sloth.

source: རབ་ཏུ་མི་གཡོ་བས་སེམས་རི་དང་མཚུངས་པ་དང་།
en: “By being unmoved, one’s mind becomes like a mountain.

source: རྗེས་སུ་ཆགས་པ་དང་ཁོང་ཁྲོ་བ་དང་བྲལ་བས་སེམས་ས་དང་མཚུངས་པ་དང་།
en: By removing attachment and anger, one’s mind becomes like the earth.

source: བསམ་པ་དག་པས་སེམས་ཆུ་དང་མཚུངས་པ་དང་།
en: By purifying one’s thoughts, one’s mind becomes like water.

source: རློམ་སེམས་མེད་པས་སེམས་མེ་དང་མཚུངས་པ་དང་།
en: By eliminating conceitedness, one’s mind becomes like fire.

source: གནས་མེད་པས་སེམས་རླུང་དང་མཚུངས་པ་དང་།
en: Being baseless, one’s mind becomes like wind.

source: ཤིན་ཏུ་དྲི་མ་མེད་པས་སེམས་ནམ་མཁའ་དང་མཚུངས་པ་དང་།
en: By becoming immaculate, one’s mind becomes like space.

source: སངས་རྒྱས་ཀྱི་ཚུལ་འཁྲུགས་པ་མེད་པའི་ཕྱིར་རབ་ཏུ་འབྱུང་བ་ལ་གཞོལ་བ་དང་།
en: “Because the way of the buddhas lies in being undisturbed, one applies oneself to the monastic way of life.

source: ལུས་དབེན་པའི་ཕྱིར་དགོན་པ་ལ་དགའ་བ་དང་།
en: Because one is physically isolated, one enjoys remote areas.

source: སེམས་དབེན་པའི་ཕྱིར་ཆོས་ལ་སྤྱོད་པ་དང་།
en: Because one is mentally isolated, one practices the Dharma.

source: དེ་བྱེད་ཅིང་ཡང་དག་པར་སྒྲུབ་པའི་ཕྱིར་ཚིག་བདེན་པ་དང་།
en: Because one practices correctly, one’s words ring true.

source: ཁ་འོག་ཏུ་ལུས་འཁྲུས་པར་བྱེད་པའི་ཕྱིར་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་བྱེད་པ་དང་།
en: Because one maintains bodily cleanliness, one practices what one preaches.

source: ཉོན་མོངས་པས་མི་རྫི་བའི་ཕྱིར་སེམས་དཔའ་བ་དང་།
en: Because one is not trampled by the afflictive emotions, one’s mind is heroic.

source: ཤིན་ཏུ་ཉམས་པ་མེད་པའི་ཕྱིར་བསླབ་པ་ཡང་དག་པར་འཛིན་པ་དང་།
en: Because one does not allow any corruption, one’s trainings are authentically upheld.

source: ཁ་ན་མ་ཐོ་བ་ཕྲ་རབ་ལ་ཡང་འཇིགས་པར་ལྟ་བའི་ཕྱིར་ཚུལ་ཁྲིམས་ལྷོད་པ་མེད་པ་དང་།
en: Because one is wary of even subtle negative actions, one’s discipline is never lax.

source: སྐྱེ་བར་སྨོན་པ་མེད་པའི་ཕྱིར་ཚུལ་ཁྲིམས་སྐྱོན་མེད་པ་དང་།
en: Because one does not hope for a further birth, one’s discipline is faultless.

source: གཅིག་ཏུ་དཀར་པོ་སྤྱོད་པའི་ཕྱིར་ཚུལ་ཁྲིམས་ཐུན་ཚགས་མ་ཡིན་པ་དང་།
en: Because one only does what is positive, one’s discipline is uninterrupted.

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་སྦྱང་བའི་ཕྱིར་དགེ་བའི་བཤེས་གཉེན་ལ་བསྟེན་པ་དང་།
en: Because one trains in the branches of awakening, one relies on a spiritual friend.

source: མིག་ཡོངས་སུ་དག་པའི་ཕྱིར་འོད་ཟེར་ཐོགས་པ་མེད་པ་དང་།
en: “Because one’s eyes are purified, light is unimpeded.

source: རྣ་བ་ཡོངས་སུ་དག་པའི་ཕྱིར་སྒྲ་ལ་ཐོགས་པ་མེད་པ་དང་།
en: Because one’s ears are purified, sound is unimpeded.

source: སྣ་ཡོངས་སུ་དག་པའི་ཕྱིར་དྲི་ལ་ཐོགས་པ་མེད་པ་དང་།
en: Because one’s nose is purified, smells are unimpeded.

source: ལྕེ་ཡོངས་སུ་དག་པའི་ཕྱིར་རོ་ལ་ཐོགས་པ་མེད་པ་དང་།
en: Because one’s tongue is purified, tastes are unimpeded.

source: ལུས་ཡོངས་སུ་དག་པའི་ཕྱིར་རེག་བྱ་ལ་ཐོགས་པ་མེད་པ་དང་།
en: Because one’s body is purified, tactile sensations are unimpeded.

source: ཡིད་ཡོངས་སུ་དག་པའི་ཕྱིར་ཆོས་ལ་ཐོགས་པ་མེད་པའོ། །
en: Because one’s mind is purified, mental phenomena are unimpeded.

source: བློ་གྲོས་རྒྱ་མཚོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ནི་མི་སྡུག་པ་ཤིན་ཏུ་བསྒོམས་པའི་ཕྱིར་འདོད་ཆགས་ཀྱི་གདུང་བ་དང་བྲལ་བ་ཡིན།
en: “Moreover, Sāgaramati, because bodhisattvas cultivate a perception of ugliness, they are free of the pain of attachment.

source: བྱམས་པ་ཤིན་ཏུ་བསྒོམས་པའི་ཕྱིར་ཞེ་སྡང་གི་གདུང་བ་དང་བྲལ་བ་ཡིན།
en: Because bodhisattvas cultivate love, they are free of the pain of aggression.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་ཤིན་ཏུ་བརྟགས་པའི་ཕྱིར་གཏི་མུག་གི་གདུང་བ་དང་བྲལ་བ་ཡིན།
en: Because bodhisattvas investigate dependent origination, they are free of the pain of delusion.

source: དབང་པོ་རྣམས་ལ་ཤིན་ཏུ་བརྟགས་པའི་ཕྱིར་སྒྲིབ་པ་དང་བྲལ་བ་ཡིན།
en: “Because they investigate the faculties, they are free of obscurations.

source: སྟོབས་ཡོངས་སུ་དག་པའི་ཕྱིར་སྒྲིབ་པ་ཡང་དག་པར་བསལ་བ་ཡིན།
en: Because their powers are purified, they dispel obscurations.

source: འབྱུང་བར་བྱ་བའི་ཁམས་ཡོངས་སུ་དག་པའི་ཕྱིར་ཀུན་ནས་ལྡང་བ་བསལ་བ་ཡིན།
en: Because the elements that will come into being are purified, they dispel further emergence.

source: ཡང་དག་པར་བསྒྲུབས་པའི་ཕྱིར་འདོད་པ་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། འཇིགས་པ་དང་། ང་རྒྱལ་དང་བྲལ་བ་ཡིན།
en: Because they practice genuinely, they are freed from desire, aggression, dullness, fear, and pride.

source: ཆོས་ཀྱི་སྦྱིན་པ་ལ་སེར་སྣ་མེད་པ་ཡིན། ཟང་ཟིང་གི་སྦྱིན་པ་ལ་ཀུན་འཛིན་པའི་སེམས་མེད་པ་ཡིན།
en: They are without stinginess in giving the Dharma and have no mental grasping to the material things they give away.

source: ཐེག་པ་དམན་པ་ལ་འདོད་པ་མེད་པའི་ཕྱིར་བྱང་ཆུབ་ཀྱི་བསམ་པ་ཡིན།
en: “Because they have no desire for the Lesser Vehicle, their thoughts are about awakening.

source: དབང་པོ་སྦས་པའི་ཕྱིར་ནང་ཉེ་བར་ཞི་བ་ཡིན།
en: Because they hide their faculties, they are at peace within.

source: སྐྱོན་ཤིན་ཏུ་མཐོང་བའི་ཕྱིར་ཕྱི་རོལ་ཉེ་བར་ཞི་བ་ཡིན།
en: Because they see their own faults, they are externally peaceful.

source: སྡིག་པ་ཐམས་ཅད་མི་བྱེད་པའི་ཕྱིར་འཁོར་བས་སྐྲག་པ་ཡིན།
en: Because they dread saṃsāra, they engage in no evil deeds.

source: དགེ་བའི་རྩ་བ་སོགས་པས་མི་ངོམས་པའི་ཕྱིར་ཡིད་ཡོངས་སུ་མི་སྐྱོ་བ་ཡིན།
en: Because they are never satisfied by their accumulation of roots of virtue, their minds are indefatigable.

source: ཆུ་བོ་བཞི་ལས་བསྒྲལ་བའི་ཕྱིར་ཆོས་ཀྱི་གྲུ་ཆེན་པོ་ཡང་དག་པར་སྦྱར་བ་ཡིན།
en: Because they are liberated from the four floods, they make good use of the great ship of Dharma.

source: ཕ་རོལ་དུ་འགྲོ་བའི་ཕྱིར་སྟེགས་དང་ཟམ་པ་ཤིན་ཏུ་བཅས་པ་ཡིན།
en: Because they have crossed, they are like stairs and bridges.

source: ཐང་ལ་ཤིན་ཏུ་གནས་པའི་ཕྱིར་འདམ་དང་འོབས་ལས་བརྒལ་བ་ཡིན་ཏེ།
en: Because they have passed through bogs and trenches, they live on level ground.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་གི་ཚེ་ཆོས་འདི་ལྟ་བུ་དེ་དག་གིས་དག་པ་དང་། ཡོངས་སུ་དག་པ་དང་། སྦྱིན་པ་འཕགས་པ་དང་། ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ་དེ་ནི་ཐམས་ཅད་མཁྱེན་པར་སེམས་བསྐྱེད་པ་རིན་པོ་ཆེ་དེ་སྦྱོང་བའོ། །
en: “Sāgaramati, when bodhisattva great beings engage in such cleansing, purification, elevated generosity, and pure discipline through such practices, they refine the jewel that develops the mind directed toward omniscience.”

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །
en: The Buddha then spoke these verses:

source: ལུས་དང་ངག་རྣམས་དང་ནི་ཡིད་བསྡམས་ཤིང་། །
en: “Bind the body, speech, and mind.

source: རྣམ་པར་དག་པའི་ལས་ལམ་བཅུ་ལ་སློབ། །
en: Train in the ten paths of pure action.

source: བྱམས་པས་སེམས་ཅན་ཀུན་ལ་ཡང་དག་ལྟ། །
en: Consider beings with love.

source: འདི་ནི་ཐམས་ཅད་མཁྱེན་པར་སེམས་སྦྱོང་ཡིན། །
en: Thus you refine the mind of omniscience.

source: སྙིང་རྗེ་ལྡན་པས་གཞན་གྱི་བྱ་བར་བརྩོན། །
en: “Endowed with compassion, energetically act for others.

source: དགའ་དང་ལྡན་པས་ཆོས་ལ་ཕ་རོལ་སྦྱོར། །
en: Endowed with joy, come to the far shore of the Dharma.

source: བཏང་སྙོམས་ལྡན་པས་ཆོས་མཆོག་འཚེ་བ་མེད། །
en: Endowed with equanimity, your highest practice is non-harm.

source: འདི་ནི་ཐམས་ཅད་མཁྱེན་པའི་སེམས་སྦྱོང་ཡིན། །
en: Thus you refine the mind of omniscience.

source: རྟག་ཏུ་དྲང་ཞིང་གཡོ་ནི་རྣམ་པར་སྤངས། །
en: “Always be honest and discard all hypocrisy.

source: གཞན་ལ་ཕན་བྱེད་སྡིག་པ་རྣམ་པར་སྤངས། །
en: Help others and discard evil deeds.

source: ལྷག་བསམ་དགེ་བ་ཅི་ཡོད་རྗེས་སུ་འཇུག །
en: With pure motivation, train in every virtue.

source: ཤེས་རབ་རབ་འཇུག་དྲན་དང་ཤེས་བཞིན་ཅན། །
en: “Develop insight, and be mindful and introspective.

source: སེམས་རབ་དུལ་བས་སེམས་ནི་ལས་སུ་རུང་། །
en: Tame the mind and make it pliant.

source: སྦྱངས་པའི་ཡོན་ཏན་རྣམས་དང་གསོ་སླ་བ། །
en: Engage in ascetic practices and be easily satisfied.

source: འཕགས་རིགས་ཆོག་ཤེས་པ་དང་ཚིག་མཉེན་དང་། །བླ་མ་རྣམས་ལ་རྟག་ཏུ་འདུད་བྱེད་དང་། །
en: “With the contentment of the noble family and kind words, Always honor your spiritual teachers.

source: རྩོད་བརྫུན་ང་རྒྱལ་སྤངས་དང་སྟོབས་ལྡན་དང་། །
en: Abandon dispute, falsity, and pride; possess the strengths.

source: བརྙས་དང་ལོག་པ་ནམ་ཡང་བྱེད་མ་ཡིན། །
en: Do not be contemptuous or make mistakes.

source: སེམས་ནི་ངེས་སེམས་མངོན་པའི་ང་རྒྱལ་བྲལ། །
en: “The mind should be resolute, with no excessive pride.

source: རྙོག་པ་མེད་ཅིང་རབ་ཏུ་དང་ལགས་ལ། །
en: Be without turbidity and utterly limpid.

source: བདག་ཤེས་པ་ལ་རིམ་གྱིས་འཇུག་པར་བྱེད། །
en: Gradually enter into self-knowledge.

source: གཞན་ལ་མི་བརྙས་སེམས་ཅན་རྗེས་སུ་སྲུང་། །
en: Do not disparage others; protect beings.

source: ཆོས་ལ་གུས་པར་དགའ་ཞིང་གུས་དང་བཅས།
en: “Be happy to respect the Dharma—just be respectful.

source: བསྒྲིམས་ཏེ་ཉོན་མོངས་རྣམས་ནི་སྤོང་བར་བྱེད། །
en: Be focused; discard all afflictive emotions.

source: ཆོས་དོན་གཉེར་ཞིང་ཆོས་ལ་རྟོན་པར་བྱེད། །
en: Be passionate about the Dharma, and rely on it.

source: རྟག་ཏུ་ཆོས་དོན་གཞོལ་ཞིང་འབབ་པར་བྱེད། །
en: Always come to a decisive conclusion about the Dharma.

source: ཆོས་ལ་བརྩོན་ཞིང་ཉོན་མོངས་མེད་པ་བསྒོམས། །
en: “Strive in the Dharma and train in the absence of afflictions.

source: ཆོས་མིན་སྤངས་ཤིང་ཆོས་རྣམས་ཡོངས་སུ་ཚོལ། །
en: Abandon what is not Dharma, and seek out the teachings.

source: དཀོན་མཆོག་གསུམ་ལ་དད་པ་མི་ཕྱེད་ལྡན། །
en: Have steadfast faith in the Three Jewels.

source: རྟག་ཏུ་འཛེམ་དང་ལྡན་ཞིང་ཉེས་སྤྱོད་ལྡོག །
en: “Always shun what you must, and stop negative actions.

source: དེ་བཞིན་གཤེགས་པ་ཀུན་ལ་ངོ་ཚས་སྡོམ། །
en: Restrain yourself with conscience before the thus-gone ones.

source: ཁྲེལ་ཡོད་ལྡན་ཞིང་འདིར་ནི་དབང་པོ་བསྡམས། །
en: Have shame and control your faculties.

source: རབ་ཏུ་སྦྱོར་བས་ལས་ཀྱི་བྱ་བར་འཇུག །
en: “Apply yourself and engage in right actions.

source: བག་ཡོད་པས་ན་མཐའ་གཉིས་འཛིན་མི་བྱེད། །
en: Be cautious and hold neither extreme.

source: མཁས་པ་སྟེན་པའི་ཆོས་རྣམས་རྗེས་རྟོགས་པ། །
en: Realize the lessons gained by attending to the learned.

source: སྤྱོད་ལམ་གྱིས་ནི་དྲང་བའི་དངོས་དང་ལྡན། །
en: “Become honest with your conduct.

source: ཁེངས་པ་མེད་པས་རྟག་ཏུ་མཉེན་པ་ཉིད། །
en: Without arrogance, be ever friendly.

source: ཞི་གནས་ཆོ་ག་ལྡན་པས་རྒོད་པ་མེད། །
en: With the practice of tranquility, eliminate agitation.

source: བློ་ནི་རབ་ཏུ་བརྟན་པས་ཉམས་པ་མེད། །
en: “With a resolute mind, do not degenerate.

source: ལྷག་མཐོང་ལ་ནི་རི་རྒྱལ་ཇི་བཞིན་ཏེ། །
en: Let your insight be like the king of mountains.

source: དམ་བཅས་བརྟན་ཞིང་བར་སྐབས་ཉམས་པ་མེད། །
en: Hold to your promises and do not let up for their duration.
